<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<title>Document</title>
</head>
<body>
	<!-- <link href="https://cdn.jsdelivr.net/npm/gotham-pro-font@1.0.0/fonts.min.css" rel="stylesheet">
	<link href="./css/style.min.css" rel="stylesheet"> -->
	<main>
		<section class="story-gen">
			<div class="story-gen__head story-gen__head_player">
				<div class="story-gen__head-body">
					<h1 class="story-gen__title">
						Персональная колыбельная: <br> <b>Владислав</b>
					</h1>
					<div class="story-gen__suptitle">
						<svg width="21" height="20" viewBox="0 0 21 20" fill="none" xmlns="http://www.w3.org/2000/svg">
						<path d="M17.6366 4.7757C17.2242 4.36319 16.7347 4.03595 16.1958 3.81269C15.657 3.58943 15.0795 3.47451 14.4962 3.47451C13.913 3.47451 13.3355 3.58943 12.7966 3.81269C12.2578 4.03595 11.7683 4.36319 11.3559 4.7757L10.5002 5.63142L9.64451 4.7757C8.81165 3.94284 7.68205 3.47495 6.5042 3.47495C5.32636 3.47495 4.19676 3.94284 3.36389 4.7757C2.53103 5.60856 2.06314 6.73817 2.06314 7.91601C2.06314 9.09385 2.53103 10.2235 3.36389 11.0563L10.5002 18.1926L17.6366 11.0563C18.0491 10.644 18.3763 10.1544 18.5996 9.61562C18.8228 9.07679 18.9377 8.49926 18.9377 7.91601C18.9377 7.33276 18.8228 6.75523 18.5996 6.21641C18.3763 5.67758 18.0491 5.18802 17.6366 4.7757Z" fill="#FC3636"/>
						<path fill-rule="evenodd" clip-rule="evenodd" d="M12.4876 3.0669C13.1244 2.80304 13.807 2.66724 14.4962 2.66724C15.1855 2.66724 15.8681 2.80304 16.5049 3.0669C17.1417 3.33075 17.7202 3.71749 18.2075 4.20501C18.6949 4.69224 19.0815 5.27071 19.3454 5.90739C19.6092 6.54418 19.745 7.22672 19.745 7.91601C19.745 8.6053 19.6092 9.28784 19.3454 9.92463C19.0815 10.5614 18.6948 11.1399 18.2074 11.6271C18.2073 11.6272 18.2073 11.6272 18.2072 11.6273L11.0711 18.7635C10.9197 18.9149 10.7143 18.9999 10.5002 18.9999C10.2861 18.9999 10.0808 18.9149 9.92939 18.7635L2.79306 11.6271C1.80881 10.6429 1.25586 9.30796 1.25586 7.91601C1.25586 6.52406 1.80881 5.18913 2.79306 4.20487C3.77732 3.22062 5.11225 2.66767 6.5042 2.66767C7.89615 2.66767 9.23108 3.22062 10.2153 4.20487L10.5002 4.48975L10.785 4.20501C10.785 4.20496 10.7851 4.20492 10.7851 4.20487C11.2724 3.71742 11.8509 3.33073 12.4876 3.0669ZM14.4962 4.28179C14.019 4.28179 13.5465 4.37581 13.1057 4.55848C12.6648 4.74115 12.2643 5.00889 11.9269 5.3464L11.0711 6.20225C10.7558 6.51751 10.2447 6.51751 9.92939 6.20225L9.07368 5.34653C8.39221 4.66507 7.46794 4.28222 6.5042 4.28222C5.54046 4.28222 4.61619 4.66507 3.93473 5.34653C3.25326 6.028 2.87041 6.95227 2.87041 7.91601C2.87041 8.87975 3.25326 9.80402 3.93473 10.4855L10.5002 17.051L17.0657 10.4855L17.0659 10.4854C17.4034 10.148 17.6711 9.74745 17.8538 9.3066C18.0364 8.86574 18.1305 8.39321 18.1305 7.91601C18.1305 7.43881 18.0364 6.96628 17.8538 6.52542C17.6711 6.08457 17.4034 5.68402 17.0659 5.34667L17.0656 5.3464C16.7282 5.00889 16.3277 4.74115 15.8868 4.55848C15.446 4.37581 14.9734 4.28179 14.4962 4.28179Z" fill="#FC3636"/>
						</svg>
						Создано с любовью
					</div>
				</div>
			</div> 
			<div class="story-gen__inner"> 
				<div class="story-gen__inner-body"> 
					<div class="story-form">
						<div class="story-form__limits">
							<div class="story-form__limit-desc">Количество <br> генераций</div>
							<!-- в style --progress-value передаем значение от 0 до 4 -->
							<div class="story-form__limit-counter" style="--progress-value:2;">
								<svg xmlns="http://www.w3.org/2000/svg">
									<circle cx="50%" cy="50%" r="50%" stroke-linecap="round"/>
									<circle cx="50%" cy="50%" r="50%" stroke-linecap="round"/>
								</svg>
								<span class="story-form__counter-current">2</span>
								<span class="story-form__counter-total">/4</span>
							</div>
						</div>
						<div class="story-form__body">
							<div class="story-form__head">
								<h2 class="story-form__title">Ваша колыбельная готова</h2>
								<p class="story-form__text">Осталось ещё 2 попытки</p>
							</div>
							<div class="story-form__items story-form__items_depth-1">
								<div class="story-form__item story-form__item_col-2">
									<div class="story-form__player">
										<div class="story-form__player-body" id="aplayer"></div>
										<!-- нужно подключить скрипт js/aplayer.js -->
										<!-- После ответа от API вызвать скрипт: -->
										<!-- <script>
											const ap = new APlayer({
												container: document.getElementById("aplayer"),
												theme: "#001489",
												audio: [
													{
														name: "Колыбельная",
														artist: "Владислав, Ирина, Олег", // имена малышей
														url: "https://chupsu.github.io/archive/eparchy/files/audio-72.mp3", // путь до аудио из API
														cover: "./img/content/nutriclub/hero.svg", // путь до картинки из API
													},
												],
											});
										</script> -->
										<div class="story-form__player-action">
											<a class="story-form__player-btn story-form__player-btn_share" href="#">
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path fill-rule="evenodd" clip-rule="evenodd" d="M18 3C16.8954 3 16 3.89543 16 5C16 6.10457 16.8954 7 18 7C19.1046 7 20 6.10457 20 5C20 3.89543 19.1046 3 18 3ZM14 5C14 2.79086 15.7909 1 18 1C20.2091 1 22 2.79086 22 5C22 7.20914 20.2091 9 18 9C15.7909 9 14 7.20914 14 5Z" fill="#001489"/>
												<path fill-rule="evenodd" clip-rule="evenodd" d="M6 10C4.89543 10 4 10.8954 4 12C4 13.1046 4.89543 14 6 14C7.10457 14 8 13.1046 8 12C8 10.8954 7.10457 10 6 10ZM2 12C2 9.79086 3.79086 8 6 8C8.20914 8 10 9.79086 10 12C10 14.2091 8.20914 16 6 16C3.79086 16 2 14.2091 2 12Z" fill="#001489"/>
												<path fill-rule="evenodd" clip-rule="evenodd" d="M18 17C16.8954 17 16 17.8954 16 19C16 20.1046 16.8954 21 18 21C19.1046 21 20 20.1046 20 19C20 17.8954 19.1046 17 18 17ZM14 19C14 16.7909 15.7909 15 18 15C20.2091 15 22 16.7909 22 19C22 21.2091 20.2091 23 18 23C15.7909 23 14 21.2091 14 19Z" fill="#001489"/>
												<path fill-rule="evenodd" clip-rule="evenodd" d="M7.72599 13.0065C8.00406 12.5293 8.6163 12.3679 9.09348 12.646L15.9235 16.626C16.4007 16.9041 16.5621 17.5163 16.284 17.9935C16.0059 18.4707 15.3937 18.6321 14.9165 18.354L8.08652 14.374C7.60934 14.0959 7.44793 13.4837 7.72599 13.0065Z" fill="#001489"/>
												<path fill-rule="evenodd" clip-rule="evenodd" d="M16.2737 6.00597C16.5521 6.48297 16.391 7.09532 15.914 7.37369L9.09403 11.3537C8.61703 11.6321 8.00468 11.471 7.72631 10.994C7.44795 10.517 7.60897 9.90468 8.08597 9.62631L14.906 5.64631C15.383 5.36795 15.9953 5.52897 16.2737 6.00597Z" fill="#001489"/>
												</svg>
											</a>
											<a class="story-form__player-btn story-form__player-btn_download" href="#" download>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path fill-rule="evenodd" clip-rule="evenodd" d="M3 14C3.55228 14 4 14.4477 4 15V19C4 19.2652 4.10536 19.5196 4.29289 19.7071C4.48043 19.8946 4.73478 20 5 20H19C19.2652 20 19.5196 19.8946 19.7071 19.7071C19.8946 19.5196 20 19.2652 20 19V15C20 14.4477 20.4477 14 21 14C21.5523 14 22 14.4477 22 15V19C22 19.7957 21.6839 20.5587 21.1213 21.1213C20.5587 21.6839 19.7957 22 19 22H5C4.20435 22 3.44129 21.6839 2.87868 21.1213C2.31607 20.5587 2 19.7957 2 19V15C2 14.4477 2.44772 14 3 14Z" fill="#001489"/>
												<path fill-rule="evenodd" clip-rule="evenodd" d="M6.29289 9.29289C6.68342 8.90237 7.31658 8.90237 7.70711 9.29289L12 13.5858L16.2929 9.29289C16.6834 8.90237 17.3166 8.90237 17.7071 9.29289C18.0976 9.68342 18.0976 10.3166 17.7071 10.7071L12.7071 15.7071C12.3166 16.0976 11.6834 16.0976 11.2929 15.7071L6.29289 10.7071C5.90237 10.3166 5.90237 9.68342 6.29289 9.29289Z" fill="#001489"/>
												<path fill-rule="evenodd" clip-rule="evenodd" d="M12 2C12.5523 2 13 2.44772 13 3V15C13 15.5523 12.5523 16 12 16C11.4477 16 11 15.5523 11 15V3C11 2.44772 11.4477 2 12 2Z" fill="#001489"/>
												</svg>
												<span>Скачать</span>
											</a>
										</div>
									</div>
								</div>
							</div>
							<div class="story-form__footer">
								<a class="story-form__btn btn primary" href="./nutriclub-gen-1.html">
									<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path d="M20.6867 3.32301C20.2623 2.89072 19.992 2.25667 19.8885 1.37008V1H19.1115V1.36968C19.0044 2.27111 18.7342 2.89103 18.3126 3.31259C17.891 3.73415 17.2711 4.00442 16.3697 4.11154H16V4.88846H16.3701C17.2567 4.99203 17.8907 5.26226 18.323 5.68673C18.7537 6.10963 19.0293 6.73014 19.1115 7.62517V8H19.8885V7.62473C19.9674 6.74444 20.2428 6.10989 20.6763 5.67634C21.1099 5.24278 21.7444 4.96737 22.6247 4.88846H23V4.11154H22.6252C21.7301 4.02931 21.1096 3.7537 20.6867 3.32301Z" fill="white"/>
									<path fill-rule="evenodd" clip-rule="evenodd" d="M2 14V12C5.00293 12 6.93688 11.3364 8.13664 10.1366C9.33641 8.93688 10 7.00293 10 4H12C12 7.00293 12.6636 8.93688 13.8634 10.1366C15.0631 11.3364 16.9971 12 20 12V14C16.9971 14 15.0631 14.6636 13.8634 15.8634C12.6636 17.0631 12 18.9971 12 22H10C10 18.9971 9.33641 17.0631 8.13664 15.8634C6.93688 14.6636 5.00293 14 2 14ZM11 16.5463C11.3687 15.752 11.8474 15.0509 12.4491 14.4491C13.0509 13.8474 13.752 13.3687 14.5463 13C13.752 12.6313 13.0509 12.1526 12.4491 11.5509C11.8474 10.9491 11.3687 10.248 11 9.45369C10.6313 10.248 10.1526 10.9491 9.55086 11.5509C8.94909 12.1526 8.248 12.6313 7.45369 13C8.248 13.3687 8.94909 13.8474 9.55086 14.4491C10.1526 15.0509 10.6313 15.752 11 16.5463Z" fill="white"/>
									</svg>
									Создать ещё
								</a>
								<a class="story-form__btn story-form__btn_disabled btn primary" href="./nutriclub-gen-1.html">
									<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path d="M20.6867 3.32301C20.2623 2.89072 19.992 2.25667 19.8885 1.37008V1H19.1115V1.36968C19.0044 2.27111 18.7342 2.89103 18.3126 3.31259C17.891 3.73415 17.2711 4.00442 16.3697 4.11154H16V4.88846H16.3701C17.2567 4.99203 17.8907 5.26226 18.323 5.68673C18.7537 6.10963 19.0293 6.73014 19.1115 7.62517V8H19.8885V7.62473C19.9674 6.74444 20.2428 6.10989 20.6763 5.67634C21.1099 5.24278 21.7444 4.96737 22.6247 4.88846H23V4.11154H22.6252C21.7301 4.02931 21.1096 3.7537 20.6867 3.32301Z" fill="white"/>
									<path fill-rule="evenodd" clip-rule="evenodd" d="M2 14V12C5.00293 12 6.93688 11.3364 8.13664 10.1366C9.33641 8.93688 10 7.00293 10 4H12C12 7.00293 12.6636 8.93688 13.8634 10.1366C15.0631 11.3364 16.9971 12 20 12V14C16.9971 14 15.0631 14.6636 13.8634 15.8634C12.6636 17.0631 12 18.9971 12 22H10C10 18.9971 9.33641 17.0631 8.13664 15.8634C6.93688 14.6636 5.00293 14 2 14ZM11 16.5463C11.3687 15.752 11.8474 15.0509 12.4491 14.4491C13.0509 13.8474 13.752 13.3687 14.5463 13C13.752 12.6313 13.0509 12.1526 12.4491 11.5509C11.8474 10.9491 11.3687 10.248 11 9.45369C10.6313 10.248 10.1526 10.9491 9.55086 11.5509C8.94909 12.1526 8.248 12.6313 7.45369 13C8.248 13.3687 8.94909 13.8474 9.55086 14.4491C10.1526 15.0509 10.6313 15.752 11 16.5463Z" fill="white"/>
									</svg>
									Создать ещё
								</a>
							</div>
						</div>
					</div>
					<div class="story-category">
						<div class="story-category__item">
							<img class="story-category__img" src="./img/content/nutriclub/card-1.png" alt="image">
							<div class="story-category__content">
								<h3 class="story-category__title">Вкусно и полезно: рецепты для кормящих мам</h3>
								<p class="story-category__text">Минимум времени, привычные продукты и понятные рецепты &mdash; меню от шеф-повара для мам в период грудного вскармливания. Здоровье и польза для мамы и малыша</p>
								<a class="story-category__link" href="#">
									<svg width="60" height="60" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path fill-rule="evenodd" clip-rule="evenodd" d="M35.7071 24.2929C36.0976 24.6834 36.0976 25.3166 35.7071 25.7071L25.7071 35.7071C25.3166 36.0976 24.6834 36.0976 24.2929 35.7071C23.9024 35.3166 23.9024 34.6834 24.2929 34.2929L34.2929 24.2929C34.6834 23.9024 35.3166 23.9024 35.7071 24.2929Z" fill="currentColor"/>
									<path fill-rule="evenodd" clip-rule="evenodd" d="M24 25C24 24.4477 24.4477 24 25 24H35C35.5523 24 36 24.4477 36 25V35C36 35.5523 35.5523 36 35 36C34.4477 36 34 35.5523 34 35V26H25C24.4477 26 24 25.5523 24 25Z" fill="currentColor"/>
									</svg>
								</a>
							</div>
						</div>  
						<div class="story-category__item">
							<img class="story-category__img" src="./img/content/nutriclub/card-2.png" alt="image">
							<div class="story-category__content">
								<h3 class="story-category__title">Грудное вскармливание: что важно знать?</h3>
								<p class="story-category__text">Как правильно прикладывать малыша к груди, правила сцеживания, полезные рекомендации по кормлению и другие нужные советы в помощь маме</p>
								<a class="story-category__link" href="#">
									<svg width="60" height="60" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path fill-rule="evenodd" clip-rule="evenodd" d="M35.7071 24.2929C36.0976 24.6834 36.0976 25.3166 35.7071 25.7071L25.7071 35.7071C25.3166 36.0976 24.6834 36.0976 24.2929 35.7071C23.9024 35.3166 23.9024 34.6834 24.2929 34.2929L34.2929 24.2929C34.6834 23.9024 35.3166 23.9024 35.7071 24.2929Z" fill="currentColor"/>
									<path fill-rule="evenodd" clip-rule="evenodd" d="M24 25C24 24.4477 24.4477 24 25 24H35C35.5523 24 36 24.4477 36 25V35C36 35.5523 35.5523 36 35 36C34.4477 36 34 35.5523 34 35V26H25C24.4477 26 24 25.5523 24 25Z" fill="currentColor"/>
									</svg>
								</a>
							</div>
						</div>
					</div>
				</div>
			</div>
		</section>
	</main>
</body>
</html>
